# ReverseIterator Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
WireTypeSet..::..ReverseIterator Method
WireTypeSet Class See Also
---
Retrieve a backward moving iterator to the set.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual WireTypeSetIterator ReverseIterator()
```

Visual Basic
---
```text
Public Overridable Function ReverseIterator As WireTypeSetIterator
```

Visual C++
---
```text
public:
virtual WireTypeSetIterator^ ReverseIterator()
```

# ### Return Value
Returns a backward moving iterator to the set.
# See Also
WireTypeSet Class
Autodesk.Revit.DB.Electrical Namespace